OpenFOAM-13/tutorials/XiFluid/stratified/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    ft  0;
    fu  0;
    egr 0;
}

zones
{
    fuelAir
    {
        type        box;
        zoneType    cell;

        box         (0 0 -1) (1 0.01 1);

        values
        {
            ft  0.07;
            fu  0.07;
            egr 0.01;
        }
    }
}

// ************************************************************************* //
